conformance/mega-backend/generated/validate-journey-direction-structure.puml
@startuml
title validate journey direction
left to right direction
usecase "Start" as n1
diamond "choose by current direction" as n2
diamond "former direction equals to" as n3
diamond "former direction equals further" as n4
rectangle "set warning to back missing" as n5
rectangle "set former direction to current direction" as n6
diamond "former direction is absent" as n7
diamond "former direction equals back" as n8
rectangle "set warning to to missing" as n9
diamond "former direction exists" as n10
rectangle "set former direction to current direction" as n11
rectangle "decision cannot continue" as n12
usecase "Stop" as n13
rectangle "evaluate is finished" as n14
diamond "former direction exists" as n15
diamond "former direction equals back" as n16
rectangle "evaluate is starting new journey" as n17
diamond "warning is absent" as n18
diamond "is not finished" as n19
diamond "next direction is absent" as n20
diamond "is starting new journey next direction" as n21
rectangle "set former direction to absent" as n22
n1 --> n2 : next
n3 --> n4 : false
n2 --> n3 : to
n3 --> n5 : true
n4 --> n5 : true
n5 --> n6 : next
n4 --> n6 : false
n7 --> n8 : false
n2 --> n7 : further or back
n7 --> n9 : true
n8 --> n9 : true
n9 --> n10 : next
n8 --> n10 : false
n10 --> n11 : true
n2 --> n12 : default
n12 --> n13 : fails
n6 --> n14 : next
n11 --> n14 : next
n10 --> n14 : false
n15 --> n16 : true
n14 --> n15 : next
n16 --> n17 : true
n15 --> n17 : false
n16 --> n17 : false
n18 --> n19 : true
n20 --> n21 : false
n19 --> n20 : true
n17 --> n18 : result
n20 --> n22 : true
n21 --> n22 : true
n22 --> n13 : returns back missing
n18 --> n13 : false; returns warning
n19 --> n13 : false; returns warning
n21 --> n13 : false; returns warning
@enduml
